# SQL Assignment

In [1]:
import pandas as pd
import sqlite3

from IPython.display import display, HTML

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
# Note that this is not the same db we have used in course videos, please download from this link
# https://drive.google.com/file/d/1O-1-L1DdNxEK6O6nG2jS31MbrMh-OnXM/view?usp=sharing

In [3]:
conn = sqlite3.connect("/content/drive/MyDrive/Colab Notebooks/3_SQL/Db-IMDB-Assignment.db")

#### Overview of all tables

In [ ]:
tables = pd.read_sql_query("SELECT NAME AS 'Table_Name' FROM sqlite_master WHERE type='table'",conn)
tables = tables["Table_Name"].values.tolist()

In [ ]:
for table in tables:
    query = "PRAGMA TABLE_INFO({})".format(table)
    schema = pd.read_sql_query(query,conn)
    print("Schema of",table)
    display(schema)
    print("-"*100)
    print("\n")

Schema of Movie

   cid       name     type  notnull dflt_value  pk
0    0      index  INTEGER        0       None   0
1    1        MID     TEXT        0       None   0
2    2      title     TEXT        0       None   0
3    3       year     TEXT        0       None   0
4    4     rating     REAL        0       None   0
5    5  num_votes  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    CID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    LID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    LID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    CID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Person

   cid    name     type  notnull dflt_value  pk
0    0   index  INTEGER        0       None   0
1    1     PID     TEXT        0       None   0
2    2    Name     TEXT        0       None   0
3    3  Gender     TEXT        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Producer

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Director

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Cast

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------

## Useful tips:

1. the year column in 'Movie' table, will have few chracters other than numbers which you need to be preprocessed, you need to get a substring of last 4 characters, its better if you convert it as int type, ex: CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)

2. For almost all the TEXT columns we have show, please try to remove trailing spaces, you need to use TRIM() function

3. When you are doing count(coulmn) it won't consider the "NULL" values, you might need to explore other alternatives like Count(*)

## Q1 --- List all the directors who directed a 'Comedy' movie in a leap year. (You need to check that the genre is 'Comedy’ and year is a leap year) Your query should return director name, the movie name, and the year.

<h4>To determine whether a year is a leap year, follow these steps:</h4>

<ul>
    <li><b>STEP-1:</b> If the year is evenly divisible by 4, go to step 2. Otherwise, go to step 5.</li>
    <li><b>STEP-2:</b> If the year is evenly divisible by 100, go to step 3. Otherwise, go to step 4.</li>
    <li><b>STEP-3:</b> If the year is evenly divisible by 400, go to step 4. Otherwise, go to step 5.</li>
    <li><b>STEP-4:</b> The year is a leap year (it has 366 days).</li>
    <li><b>STEP-5:</b> The year is not a leap year (it has 365 days).</li>
</ul>

Year 1900 is divisible by 4 and 100 but it is not divisible by 400, so it is not a leap year.

In [51]:
%%time
def grader_1(q1):
    q1_results  = pd.read_sql_query(q1,conn)
    print(q1_results.head(10))
    print(q1_results.shape)
    assert (q1_results.shape == (232,3))
#unassigned to remove noninteger value from year column they are harcters stored 
query1 = """select a.title,c.name,a.year from Movie a,M_Director b ,person c where  
((CAST(SUBSTR(a.year,-4) AS UNSIGNED) %4 = 0 ) ) and c.pid=b.pid and a.mid=b.mid and a.mid in 
(select Mid from  M_Genre where gid in (select gid from genre where name like '%Comedy%')) """
grader_1(query1)

                               title               Name  year
0                         Mastizaade       Milap Zaveri  2016
1  Harold & Kumar Go to White Castle       Danny Leiner  2004
2                 Gangs of Wasseypur     Anurag Kashyap  2012
3        Around the World in 80 Days       Frank Coraci  2004
4             The Accidental Husband      Griffin Dunne  2008
5                             Barfi!        Anurag Basu  2012
6                  Bride & Prejudice    Gurinder Chadha  2004
7    Beavis and Butt-Head Do America         Mike Judge  1996
8                            Dostana   Tarun Mansukhani  2008
9                      Kapoor & Sons       Shakun Batra  2016
(232, 3)
CPU times: user 64.8 ms, sys: 0 ns, total: 64.8 ms
Wall time: 71.1 ms

## Q2 --- List the names of all the actors who played in the movie 'Anand' (1971)

In [ ]:
%%time
def grader_2(q2):
    q2_results  = pd.read_sql_query(q2,conn)
    print(q2_results.head(10))
    print(q2_results.shape)
    assert (q2_results.shape == (17,1))
#use TRIM in mcast for pid 

query2 = "select name from Person a where  a.pid in (select trim(pid) from m_cast where mid in (select mid from movie where title like 'Anand' ))"
grader_2(query2)

                Name
0   Amitabh Bachchan
1      Rajesh Khanna
2      Sumita Sanyal
3         Ramesh Deo
4          Seema Deo
5     Asit Kumar Sen
6         Dev Kishan
7       Atam Prakash
8      Lalita Kumari
9             Savita
(17, 1)
CPU times: user 23.8 ms, sys: 2.99 ms, total: 26.8 ms
Wall time: 29.8 ms

## Q3 --- List all the actors who acted in a film before 1970 and in a film after 1990. (That is: < 1970 and > 1990.)

In [ ]:
%%time

def grader_3a(query_less_1970, query_more_1990):
    q3_a = pd.read_sql_query(query_less_1970,conn)
    print(q3_a.shape)
    q3_b = pd.read_sql_query(query_more_1990,conn)
    print(q3_b.shape)
    return (q3_a.shape == (4942,1)) and (q3_b.shape == (62570,1))

query_less_1970 =""" 
Select p.PID from Person p 
inner join 
(
    select trim(mc.PID) PD, mc.MID from M_cast mc 
where mc.MID 
in 
(
    select mv.MID from Movie mv where CAST(SUBSTR(mv.year,-4) AS Integer)<1970
)
) r1 
on r1.PD=p.PID 
"""
query_more_1990 =""" 
Select p.PID from Person p 
inner join 
(
    select trim(mc.PID) PD, mc.MID from M_cast mc 
where mc.MID 
in 
(
    select mv.MID from Movie mv where CAST(SUBSTR(mv.year,-4) AS Integer)>1990
)
) r1 
on r1.PD=p.PID """
print(grader_3a(query_less_1970, query_more_1990))

# using the above two queries, you can find the answer to the given question

(4942, 1)
(62570, 1)
True
CPU times: user 234 ms, sys: 7.78 ms, total: 242 ms
Wall time: 243 ms

In [ ]:
%%time
def grader_3(q3):
    q3_results  = pd.read_sql_query(q3,conn)
    print(q3_results.head(10))
    print(q3_results.shape)
    assert (q3_results.shape == (300,1))

#query3 = "select distinct name from person where  trim(pid) in (select trim(pid) from m_cast where  mid not in (select mid from movie where CAST(SUBSTR(year,-4) AS Integer) between 1970 and 1990))"
query3="""with first as (
SELECT Trim(mc.pid) as pid1
FROM   m_cast mc 
WHERE  Trim(mc.mid) IN (SELECT Trim(m.mid) 
                        FROM   movie m 
                        WHERE  Cast(Substr(Trim(m.year), -4) AS INTEGER) < 1970)
),
second as (
SELECT trim(mc.pid) as pid2
FROM   m_cast mc 
WHERE  trim(mc.mid) in (SELECT Trim(m.mid) 
                        FROM   movie m 
                        WHERE  Cast(Substr(Trim(m.year), -4) AS INTEGER) > 1990) 
)
select first.pid1 from first intersect select second.pid2 from second """
grader_3(query3)

        pid1
0  nm0000821
1  nm0003987
2  nm0004334
3  nm0004429
4  nm0004432
5  nm0004433
6  nm0004434
7  nm0004435
8  nm0004564
9  nm0004569
(300, 1)
CPU times: user 117 ms, sys: 1.9 ms, total: 119 ms
Wall time: 122 ms

## Q4 --- List all directors who directed 10 movies or more, in descending order of the number of movies they directed. Return the directors' names and the number of movies each of them directed.

In [ ]:
%%time

def grader_4a(query_4a):
    query_4a = pd.read_sql_query(query_4a,conn)
    print(query_4a.head(10)) 
    print(query_4a.shape) 
    return (query_4a.shape == (1462,2))

query_4a =""" *** Write a query, which will return all the directors(id's) along with the number of movies they directed *** """
query_4a="""select pid,count(*) as T_movie from m_director group by  pid having count(*)>=1 """
print(grader_4a(query_4a))

# using the above query, you can write the answer to the given question

         PID  T_movie
0  nm0000180        1
1  nm0000187        1
2  nm0000229        1
3  nm0000269        1
4  nm0000386        1
5  nm0000487        2
6  nm0000965        1
7  nm0001060        1
8  nm0001162        1
9  nm0001241        1
(1462, 2)
True
CPU times: user 14.4 ms, sys: 0 ns, total: 14.4 ms
Wall time: 15.2 ms

In [ ]:
%%time
def grader_4(q4):
    q4_results  = pd.read_sql_query(q4,conn)
    print(q4_results.head(10))
    print(q4_results.shape)
    assert (q4_results.shape == (58,2))
query4 ="select A.T_movie,p.name from (select pid,count(*) as T_movie from m_director group by  pid having count(*)>=10) as A ,person p where A.pid=p.pid order by a.T_movie desc"
grader_4(query4)

   T_movie                   Name
0       39           David Dhawan
1       35           Mahesh Bhatt
2       30        Ram Gopal Varma
3       30           Priyadarshan
4       29           Vikram Bhatt
5       27   Hrishikesh Mukherjee
6       21            Yash Chopra
7       19         Shakti Samanta
8       19        Basu Chatterjee
9       18           Subhash Ghai
(58, 2)
CPU times: user 22.1 ms, sys: 932 µs, total: 23 ms
Wall time: 30.1 ms

## Q5.a --- For each year, count the number of movies in that year that had only female actors.

In [ ]:
%%time

# note that you don't need TRIM for person table

def grader_5aa(query_5aa):
    query_5aa = pd.read_sql_query(query_5aa,conn)
    print(query_5aa.head(10)) 
    return (query_5aa.shape == (8846,3))

query_5aa =""" *** Write your query that will get movie id, and number of people for each geneder *** """

print(grader_5aa(query_5aa))

def grader_5ab(query_5ab):
    query_5ab = pd.read_sql_query(query_5ab,conn)
    print(query_5ab.head(10)) 
    return (query_5ab.shape == (3469, 3))

query_5ab =""" *** Write your query that will have at least one male actor try to use query that you have written above *** """

print(grader_5ab(query_5ab))


# using the above queries, you can write the answer to the given question

         MID    Gend  Count
0  tt0021594    None      1
1  tt0021594  Female      3
2  tt0021594    Male      5
3  tt0026274    None      2
4  tt0026274  Female     11
5  tt0026274    Male      9
6  tt0027256    None      2
7  tt0027256  Female      5
8  tt0027256    Male      8
9  tt0028217  Female      3
True
         MID  Gend  Count
0  tt0021594  Male      5
1  tt0026274  Male      9
2  tt0027256  Male      8
3  tt0028217  Male      7
4  tt0031580  Male     27
5  tt0033616  Male     46
6  tt0036077  Male     11
7  tt0038491  Male      7
8  tt0039654  Male      6
9  tt0040067  Male     10
(3469, 3)
True
Wall time: 1.5 s

In [ ]:
%%time
def grader_5a(q5a):
    q5a_results  = pd.read_sql_query(q5a,conn)
    print(q5a_results.head(10))
    print(q5a_results.shape)
    assert (q5a_results.shape == (4,2))
#query5a = "select  distinct m.title,m.year,p.name ,p.gender from movie m,m_cast c,person p where p.gender like 'Female' and trim(c.pid)=trim(p.pid) and c.mid=m.mid"
query5a="""
 
 WITH all_cast AS (
    SELECT SUBSTR(m."year",-4) as 'Year', m.title, trim(m.MID) as MID, p.Name, trim(p.Gender) as Gender  
    FROM Movie m
    JOIN M_Cast mc 
        ON m.MID = mc.MID
    JOIN Person p 
        ON trim(mc.PID) = p.PID
),

male_present AS (
    SELECT year, mid, name
    FROM all_cast
    WHERE Gender = 'Male'
)


SELECT year, COUNT(DISTINCT mid) as 'All Female Cast'
FROM all_cast a
WHERE NOT EXISTS (SELECT * FROM male_present WHERE a.mid = mid)
GROUP BY year
"""
grader_5a(query5a)

   Year  All Female Cast
0  1939                1
1  1999                1
2  2000                1
3  2018                1
(4, 2)
CPU times: user 1.31 s, sys: 18.8 ms, total: 1.33 s
Wall time: 1.33 s

## Q5.b --- Now include a small change: report for each year the percentage of movies in that year with only female actors, and the total number of movies made that year. For example, one answer will be: 1990 31.81 13522 meaning that in 1990 there were 13,522 movies, and 31.81% had only female actors. You do not need to round your answer.

In [ ]:
%%time
def grader_5b(q5b):
    q5b_results  = pd.read_sql_query(q5b,conn)
    print(q5b_results.head(10))
    print(q5b_results.shape)
    assert (q5b_results.shape == (4,3))

query5b = """ 
 select movie.year, count(movie.mid) as Year_Wise_Movie_Count,cast(x.Female_Cast_Only as real) / count(movie.mid) As Percentage_of_Female_Cast from movie
inner join
(
SELECT Movie.year as Year, COUNT(Movie.mid) AS Female_Cast_Only
FROM Movie
WHERE Movie.MID NOT IN (
  SELECT Movie.MID from Movie
  Inner Join M_cast
  on TRIM(M_cast.MID) = Movie.MID
  Inner Join Person
  on TRIM(M_cast.PID) = Person.PID
  WHERE Person.Gender!='Female'
  GROUP BY Movie.MID
  )
GROUP BY Movie.year
Order By Movie.year asc
) x
on x.year = movie.year 
GROUP BY movie.year
ORDER BY movie.year
"""
grader_5b(query5b)

     year  Year_Wise_Movie_Count  Percentage_of_Female_Cast
0    1939                      2                   0.500000
1    1999                     66                   0.015152
2    2000                     64                   0.015625
3  I 2018                     10                   0.100000
(4, 3)
CPU times: user 213 ms, sys: 1.91 ms, total: 215 ms
Wall time: 219 ms

## Q6 --- Find the film(s) with the largest cast. Return the movie title and the size of the cast. By "cast size" we mean the number of distinct actors that played in that movie: if an actor played multiple roles, or if it simply occurs multiple times in casts, we still count her/him only once.

In [ ]:
%%time
def grader_6(q6):
    q6_results  = pd.read_sql_query(q6,conn)
    print(q6_results.head(10))
    print(q6_results.shape)
    assert (q6_results.shape == (3473, 2))

query6 = "select mv.title,A.coun from  (select mid, count(*)as coun from m_cast group by mid having count(*) >=1) as A,movie mv where mv.mid=A.mid order by A.coun desc "
grader_6(query6)

                        title  coun
0               Ocean's Eight   238
1                    Apaharan   233
2                        Gold   215
3             My Name Is Khan   213
4  Captain America: Civil War   191
5                    Geostorm   170
6                     Striker   165
7                        2012   154
8                      Pixels   144
9       Yamla Pagla Deewana 2   140
(3473, 2)
CPU times: user 58.9 ms, sys: 4.97 ms, total: 63.8 ms
Wall time: 67.6 ms

### Q7 --- A decade is a sequence of 10 consecutive years. 
### For example, say in your database you have movie information starting from 1931. 
### the first decade is 1931, 1932, ..., 1940,
### the second decade is 1932, 1933, ..., 1941 and so on. 
### Find the decade D with the largest number of films and the total number of films in D

In [ ]:
%%time
def grader_7a(q7a):
    q7a_results  = pd.read_sql_query(q7a,conn)
    print(q7a_results.head(10))
    print(q7a_results.shape)
    assert (q7a_results.shape == (78, 2))# there are distinct 125 years so 78 is not possible here

#query7a = """ *** Write a query that computes number of movies in each year *** """
query7a="select year as movie_year,count(mid) from movie group by year having count(mid) >=1 limit 78"
grader_7a(query7a)

# using the above query, you can write the answer to the given question

  movie_year  count(mid)
0       1931           1
1       1936           3
2       1939           2
3       1941           1
4       1943           1
5       1946           2
6       1947           2
7       1948           3
8       1949           3
9       1950           2
(78, 2)
CPU times: user 8.26 ms, sys: 861 µs, total: 9.12 ms
Wall time: 15.1 ms

In [ ]:
%%time
def grader_7b(q7b):
    q7b_results  = pd.read_sql_query(q7b,conn)
    print(q7b_results.head(10))
    print(q7b_results.shape)
    assert (q7b_results.shape == (713, 4))

#query7b_= 
"""   
    *** 
    Write a query that will do joining of the above table(7a) with itself 
    such that you will join with only rows if the second tables year is <= current_year+9 and more than or equal current_year
    *** 
          """
query7b="""

with mov as
(
   select year as movie_year, count(mid) as total_movies
   from movie 
   group by year
   limit 78
)
select
  *
from mov m1
left join mov m2 on (m2.movie_year between m1.movie_year and m1.movie_year + 9)
"""          
grader_7b(query7b)
# if you see the below results the first movie year is less than 2nd movie year and 
# 2nd movie year is less or equal to the first movie year+9

# using the above query, you can write the answer to the given question

  movie_year  total_movies movie_year  total_movies
0       1931             1       1931             1
1       1931             1       1936             3
2       1931             1       1939             2
3       1936             3       1936             3
4       1936             3       1939             2
5       1936             3       1941             1
6       1936             3       1943             1
7       1939             2       1939             2
8       1939             2       1941             1
9       1939             2       1943             1
(713, 4)
CPU times: user 15.6 ms, sys: 832 µs, total: 16.4 ms
Wall time: 18.3 ms

In [ ]:
%%time
def grader_7(q7):
    q7_results  = pd.read_sql_query(q7,conn)
    print(q7_results.head(10))
    assert (q7_results.shape == (1, 2))

query7 = """ *** Write a query that will return the decade that has maximum number of movies ***"""
grader_7(query7)
# if you check the output we are printinng all the year in that decade, its fine you can print 2008 or 2008-2017

   Decade_Movie_Count                                             Decade
0                1203  2008-2009-2010-2011-2012-2013-2014-2015-2016-2017
Wall time: 21 ms

In [ ]:
%%time
def grader_7(q7):
    q7_results  = pd.read_sql_query(q7,conn)
    print(q7_results.head(10))
    assert (q7_results.shape == (1, 3))

query7 = """
with mov as
(
   select year as movie_year, count(mid) as total_movies
   from movie 
   group by year
)
select
  m1.movie_year as decade_start,
  max(m2.movie_year) as decade_end,
  sum(m2.total_movies) as total_movies
from mov m1
left join mov m2 on (m2.movie_year between m1.movie_year and m1.movie_year + 9)
group by m1.movie_year
order by sum(m2.total_movies) desc
limit 1


"""
grader_7(query7)
# if you check the output we are printinng all the year in that decade, its fine you can print 2008 or 2008-2017

  decade_start decade_end  total_movies
0         2008       2017          1126
CPU times: user 18.4 ms, sys: 731 µs, total: 19.1 ms
Wall time: 28.5 ms

## Q8 --- Find all the actors that made more movies with Yash Chopra than any other director.

In [ ]:
%%time
def grader_8a(q8a):
    q8a_results  = pd.read_sql_query(q8a,conn)
    print(q8a_results.head(10))
    print(q8a_results.shape)
    assert (q8a_results.shape == (73408, 3))

#query8a = """ *** Write a query that will results in number of movies actor-director worked together ***"""
query8a="""
select mc.pid as mcpid,md.pid as mdpid,count(mc.MID) as count   
from m_cast as mc
                 join m_director md 
                     on md.MID=mc.MID               
                 group by mc.pid ,md.pid 
"""
grader_8a(query8a)

# using the above query, you can write the answer to the given question

        mcpid      mdpid  count
0   nm0000002  nm0496746      1
1   nm0000027  nm0000180      1
2   nm0000039  nm0896533      1
3   nm0000042  nm0896533      1
4   nm0000047  nm0004292      1
5   nm0000073  nm0485943      1
6   nm0000076  nm0000229      1
7   nm0000092  nm0178997      1
8   nm0000093  nm0000269      1
9   nm0000096  nm0113819      1
(73408, 3)
CPU times: user 235 ms, sys: 13.7 ms, total: 249 ms
Wall time: 251 ms

In [ ]:
%%time

def grader_8(q8):
    q8_results  = pd.read_sql_query(q8,conn)
    print(q8_results.head(10))
    print(q8_results.shape)
    assert (q8_results.shape == (245, 2))

query8_results = """ 
select p.name,h.count 
from(select mc.pid as mcpid,md.pid as mdpid,count(mc.MID) as count   
from m_cast as mc
                 join m_director md 
                     on md.MID=mc.MID               
                 group by mc.pid ,md.pid 
                ) h
            join person p 
                on trim(h.mcpid)=trim(p.pid)
            where h.count = (select count(*) as count   
                             from m_cast as mc
                             join m_director md 
                                 on md.mid=mc.mid
                             where mc.pid=h.mcpid 
                             group by mc.pid,md.pid 
                             order by count(*) desc
                             limit 1)
            and h.mdpid = (select trim(pid) 
                           from person 
                           where name like '%Yash Chopra%'
                          )
            order by h.count desc
"""
grader_8(query8_results)

                Name  count
0        Jagdish Raj     11
1   Manmohan Krishna     10
2           Iftekhar      9
3      Shashi Kapoor      7
4     Waheeda Rehman      5
5      Rakhee Gulzar      5
6     Achala Sachdev      4
7        Neetu Singh      4
8           Ravikant      4
9    Parikshat Sahni      3
(245, 2)
CPU times: user 6.26 s, sys: 409 ms, total: 6.67 s
Wall time: 6.67 s

## Q9 --- The Shahrukh number of an actor is the length of the shortest path between the actor and Shahrukh Khan in the "co-acting" graph. That is, Shahrukh Khan has Shahrukh number 0; all actors who acted in the same film as Shahrukh have Shahrukh number 1; all actors who acted in the same film as some actor with Shahrukh number 1 have Shahrukh number 2, etc. Return all actors whose Shahrukh number is 2.

In [ ]:
%%time
def grader_9a(q9a):
    q9a_results  = pd.read_sql_query(q9a,conn)
    print(q9a_results.head(10))
    print(q9a_results.shape)
    assert (q9a_results.shape == (2382, 1))

query9a = """ *** Write a query that answers the 9th question ***"""
grader_9a(query9a)
# using the above query, you can write the answer to the given question

# selecting actors who acted with srk (S1)
# selecting all movies where S1 actors acted, this forms S2 movies list
# selecting all actors who acted in S2 movies, this gives us S2 actors along with S1 actors
# removing S1 actors from the combined list of S1 & S2 actors, so that we get only S2 actors

      S1_PID
0  nm0004418
1  nm1995953
2  nm2778261
3  nm0631373
4  nm0241935
5  nm0792116
6  nm1300111
7  nm0196375
8  nm1464837
9  nm2868019
(2382, 1)
Wall time: 178 ms

In [ ]:
%%time

def grader_9(q9):
    q9_results  = pd.read_sql_query(q9,conn)
    print(q9_results.head(10))
    print(q9_results.shape)
    assert (q9_results.shape == (2382, 1))

query9 = """
WITH 
    SHAHRUKH_0 AS
    (
        SELECT
            TRIM(P.PID) PID
        FROM
            Person P
        WHERE
            Trim(P.Name) like '%Shahrukh%'
          
    ),-----------------------------srk id getting
    SHAHRUKH_1_MOVIES AS
    (
        SELECT
            DISTINCT
            TRIM(MC.MID) MID,
            S0.PID
        FROM
            M_Cast MC,
            SHAHRUKH_0 S0
        WHERE
            TRIM(MC.PID) = S0.PID---getting movied id,pid  where sharukh aacted
    ),
    SHAHRUKH_1_ACTORS AS
    (
        SELECT
            DISTINCT
            TRIM(MC.PID) PID
        FROM
            M_Cast MC,
            SHAHRUKH_1_MOVIES S1M
        WHERE
            TRIM(MC.MID) = S1M.MID AND---- selecting actors who acted with srk (S1)
            TRIM(MC.PID) <> S1M.PID-----removing sharukh id from  sharukh movie and getting other person details
    ),
    SHAHRUKH_2_MOVIES AS
    (
        SELECT
            DISTINCT
            TRIM(MC.MID) MID,
            S1A.PID
        FROM
            M_Cast MC,
            SHAHRUKH_1_ACTORS S1A
        WHERE
            TRIM(MC.PID) = S1A.PID  ---selecting all movies where S1 actors acted, this forms S2 movies list
    )
    SELECT
        DISTINCT
        TRIM(P.Name) ACTOR_NAME
    FROM
        Person P,
        M_Cast MC,
        SHAHRUKH_2_MOVIES S2M, SHAHRUKH_1_ACTORS S1A
    WHERE
            TRIM(MC.PID) = TRIM(P.PID) AND--selecting all actors who acted in S2 movies, this gives us S2 actors along with S1 actors
            TRIM(MC.MID) = S2M.MID AND----movies of sharukh can/cant
            TRIM(MC.PID) <> TRIM(S2M.PID)   ------------removing S1 actors from the combined list of S1 & S2 actors, so that we get only S2 actors
    limit 2382

"""
grader_9(query9)

              ACTOR_NAME
0           Freida Pinto
1  Caroline Christl Long
2          Rajeev Pahuja
3      Michelle Santiago
4         Jandre le Roux
5             Raj Awasti
6        Michael Chapman
7            James Heron
8              Alex Jaep
9        Marian Lorencik
(2382, 1)
CPU times: user 1min 31s, sys: 3.75 s, total: 1min 35s
Wall time: 1min 34s